In [2]:
# imports
import nltk
import numpy as np
import pandas as pd
from pandas.io.json import json_normalize
import json

from textblob import TextBlob
from textblob import Word
from nltk.stem import PorterStemmer
try:
    from nltk.corpus import stopwords
    stop = stopwords.words('english')
except:
    nltk.download('stopwords')

In [5]:
json_data = {}

with open('../../data/raw/yp_leilanis-lahaina-2_rws.json') as f:
    json_data = json.loads(f.read())

dataset = json_normalize(json_data['reviews'])
dataset.head()

,author,datePublished,description,ratingValue
0,Giorgio C.,2018-10-13,"Try good service, beach front so a bit loud. M...",4
1,Maxx C.,2018-10-05,When we arrived they gave us a choice of eatin...,5
2,Al D.,2018-10-04,Stopped in here on a Tuesday evening around 8p...,4
3,Zachary D.,2018-09-29,Hawaiian chain type restaurant with pretty dec...,4
4,Chilly P.,2018-07-10,Oh my. Where do I even begin...\n\nLet's start...,1

In [6]:
reviews = dataset.iloc[:,2]
reviews.head()

0    Try good service, beach front so a bit loud. M...
1    When we arrived they gave us a choice of eatin...
2    Stopped in here on a Tuesday evening around 8p...
3    Hawaiian chain type restaurant with pretty dec...
4    Oh my. Where do I even begin...\n\nLet's start...
Name: description, dtype: object

In [7]:
dataset['word_count'] = reviews.apply(lambda x: len(str(x).split(" ")))

In [8]:
dataset['chr_count'] = reviews.str.len()

In [9]:
def avg_word(sentence):
  words = sentence.split()
  return (sum(len(word) for word in words)/len(words))
dataset['avg_word_len'] = reviews.apply(lambda x: avg_word(x))

In [10]:
dataset['num_of_stopwords'] = reviews.apply(lambda x: len([x for x in x.split() if x in stop]))

In [11]:
dataset['hashtags'] = reviews.apply(lambda x: len([x for x in x.split() if x.startswith('#')]))

In [12]:
dataset['numerics'] = reviews.apply(lambda x: len([x for x in x.split() if x.isdigit()]))

In [13]:
dataset['uppercase_cnt'] = reviews.apply(lambda x: len([x for x in x.split() if x.isupper()]))

In [14]:
dataset.head()

,author,datePublished,description,ratingValue,word_count,chr_count,avg_word_len,num_of_stopwords,hashtags,numerics,uppercase_cnt
0,Giorgio C.,2018-10-13,"Try good service, beach front so a bit loud. M...",4,68,447,5.371429,17,0,0,1
1,Maxx C.,2018-10-05,When we arrived they gave us a choice of eatin...,5,178,889,4.098266,79,0,1,2
2,Al D.,2018-10-04,Stopped in here on a Tuesday evening around 8p...,4,100,503,4.020000,52,0,0,2
3,Zachary D.,2018-09-29,Hawaiian chain type restaurant with pretty dec...,4,131,728,4.484848,48,0,0,0
4,Chilly P.,2018-07-10,Oh my. Where do I even begin...\n\nLet's start...,1,388,2134,4.313283,138,0,0,20

In [17]:
dataset.to_csv('../../data/processed/yp_leilanis-lahaina-2_rws_basicfeatures.csv', index=False)

In [18]:
dataset_test = pd.read_csv('../../data/processed/yp_leilanis-lahaina-2_rws_basicfeatures.csv')
dataset_test.head()

,author,datePublished,description,ratingValue,word_count,chr_count,avg_word_len,num_of_stopwords,hashtags,numerics,uppercase_cnt
0,Giorgio C.,2018-10-13,"Try good service, beach front so a bit loud. M...",4,68,447,5.371429,17,0,0,1
1,Maxx C.,2018-10-05,When we arrived they gave us a choice of eatin...,5,178,889,4.098266,79,0,1,2
2,Al D.,2018-10-04,Stopped in here on a Tuesday evening around 8p...,4,100,503,4.020000,52,0,0,2
3,Zachary D.,2018-09-29,Hawaiian chain type restaurant with pretty dec...,4,131,728,4.484848,48,0,0,0
4,Chilly P.,2018-07-10,Oh my. Where do I even begin...\r\n\r\nLet's s...,1,388,2134,4.313283,138,0,0,20

In [5]:
dataset_test2 = pd.read_csv('../../data/processed/yp_kimos-maui-lahaina_rws.csv')
dataset_test2.head()

   status                                            reviews
0       1  Kimo's never disappoints.  We come here once o...
1       0  I was there the first week of October and Firs...
2       1  This place was on my "Must Do Maui" list and i...
3       0  Monday night dinner here and they quickly sat ...
4       1  Nice view and amazing cocktails. They are loca...